matekai/STM32F401RE_prj000/prj/inc/iodefine.h
/* =================================================
 * IO definition file for STM32F4xx [iodefine.h]
 * By matekai
 * -------------------------------------------------
 * << REVISION HISTORY >>
 * 2020/07/xx Ver. 1.00 by matekai
 * Initial release.
 *
================================================== */

#ifndef IODEFINE_H
#define IODEFINE_H

/* =============================
 * BaseAddress Definition
============================= */
// AHB2
#define OTG_FS_BAR 0x50000000UL

// AHB1
#define AHB1_WINDOW 0x40020000UL

#define DMA2_BAR  ( AHB1_WINDOW + 0x6400UL )
#define DMA1_BAR  ( AHB1_WINDOW + 0x6000UL )
#define RCC_BAR   ( AHB1_WINDOW + 0x3800UL )
#define CRC_BAR   ( AHB1_WINDOW + 0x3000UL )
#define GPIOH_BAR ( AHB1_WINDOW + 0x1C00UL )
#define GPIOE_BAR ( AHB1_WINDOW + 0x1000UL )
#define GPIOD_BAR ( AHB1_WINDOW + 0x0C00UL )
#define GPIOC_BAR ( AHB1_WINDOW + 0x0800UL )
#define GPIOB_BAR ( AHB1_WINDOW + 0x0400UL )
#define GPIOA_BAR ( AHB1_WINDOW + 0x0000UL )

// APB2
#define APB2_WINDOW 0x40010000UL

#define TIM11_BAR   ( APB2_WINDOW + 0x4800UL )
#define TIM10_BAR   ( APB2_WINDOW + 0x4400UL )
#define TIM9_BAR    ( APB2_WINDOW + 0x4000UL )
#define EXTI_BAR    ( APB2_WINDOW + 0x3C00UL )
#define SYSCFG_BAR  ( APB2_WINDOW + 0x3800UL )
#define SPI4_BAR    ( APB2_WINDOW + 0x3400UL )
#define SPI1_BAR    ( APB2_WINDOW + 0x3000UL )
#define SDIO_BAR    ( APB2_WINDOW + 0x2C00UL )
#define ADC1_BAR    ( APB2_WINDOW + 0x2000UL )
#define USART6_BAR  ( APB2_WINDOW + 0x1400UL )
#define USART1_BAR  ( APB2_WINDOW + 0x1000UL )
#define TIM1_BAR    ( APB2_WINDOW + 0x0000UL )

// APB1
#define APB1_WINDOW 0x40000000UL

#define PWR_BAR     ( APB1_WINDOW + 0x7000UL )
#define I2C3_BAR    ( APB1_WINDOW + 0x5C00UL )
#define I2C2_BAR    ( APB1_WINDOW + 0x5800UL )
#define I2C1_BAR    ( APB1_WINDOW + 0x5400UL )
#define USART2_BAR  ( APB1_WINDOW + 0x4400UL )
#define I2S3EXT_BAR ( APB1_WINDOW + 0x4000UL )
#define SPI3_BAR    ( APB1_WINDOW + 0x3C00UL )
#define SPI2_BAR    ( APB1_WINDOW + 0x3800UL )
#define I2S2EXT_BAR ( APB1_WINDOW + 0x3400UL )
#define IWDG_BAR    ( APB1_WINDOW + 0x3000UL )
#define WWDG_BAR    ( APB1_WINDOW + 0x2C00UL )
#define RTC_BAR     ( APB1_WINDOW + 0x2800UL )
#define TIM5_BAR    ( APB1_WINDOW + 0x0C00UL )
#define TIM4_BAR    ( APB1_WINDOW + 0x0800UL )
#define TIM3_BAR    ( APB1_WINDOW + 0x0400UL )
#define TIM2_BAR    ( APB1_WINDOW + 0x0000UL )

// PPB
#define PPB_WINDOW 0xE0000000UL

#define STK_BAR       ( PPB_WINDOW + 0xE010UL )
#define NVIC_BAR      ( PPB_WINDOW + 0xE000UL )
#define SCB_BAR       ( PPB_WINDOW + 0xED00UL )
#define CPR_BAR       ( PPB_WINDOW + 0xED88UL )
#define MPU_BAR       ( PPB_WINDOW + 0xED90UL )
#define NVIC_STIR_BAR ( PPB_WINDOW + 0xEF00UL )
#define FPU_BAR       ( PPB_WINDOW + 0xEF30UL )

/* ==========================
 *  GPIO SFR definition
========================== */

#define GPIOA_MODER   ( *( ( volatile unsigned long int *)( GPIOA_BAR + 0x00UL ) ) )
#define GPIOA_OTYPER  ( *( ( volatile unsigned long int *)( GPIOA_BAR + 0x04UL ) ) )
#define GPIOA_OSPEEDR ( *( ( volatile unsigned long int *)( GPIOA_BAR + 0x08UL ) ) )
#define GPIOA_PUPDR   ( *( ( volatile unsigned long int *)( GPIOA_BAR + 0x0CUL ) ) )
#define GPIOA_IDR     ( *( ( volatile unsigned long int *)( GPIOA_BAR + 0x10UL ) ) )
#define GPIOA_ODR     ( *( ( volatile unsigned long int *)( GPIOA_BAR + 0x14UL ) ) )
#define GPIOA_BSRR    ( *( ( volatile unsigned long int *)( GPIOA_BAR + 0x18UL ) ) )
#define GPIOA_LCKR    ( *( ( volatile unsigned long int *)( GPIOA_BAR + 0x1CUL ) ) )
#define GPIOA_AFRL    ( *( ( volatile unsigned long int *)( GPIOA_BAR + 0x20UL ) ) )
#define GPIOA_AFRH    ( *( ( volatile unsigned long int *)( GPIOA_BAR + 0x24UL ) ) )

#define GPIOB_MODER   ( *( ( volatile unsigned long int *)( GPIOB_BAR + 0x00UL ) ) )
#define GPIOB_OTYPER  ( *( ( volatile unsigned long int *)( GPIOB_BAR + 0x04UL ) ) )
#define GPIOB_OSPEEDR ( *( ( volatile unsigned long int *)( GPIOB_BAR + 0x08UL ) ) )
#define GPIOB_PUPDR   ( *( ( volatile unsigned long int *)( GPIOB_BAR + 0x0CUL ) ) )
#define GPIOB_IDR     ( *( ( volatile unsigned long int *)( GPIOB_BAR + 0x10UL ) ) )
#define GPIOB_ODR     ( *( ( volatile unsigned long int *)( GPIOB_BAR + 0x14UL ) ) )
#define GPIOB_BSRR    ( *( ( volatile unsigned long int *)( GPIOB_BAR + 0x18UL ) ) )
#define GPIOB_LCKR    ( *( ( volatile unsigned long int *)( GPIOB_BAR + 0x1CUL ) ) )
#define GPIOB_AFRL    ( *( ( volatile unsigned long int *)( GPIOB_BAR + 0x20UL ) ) )
#define GPIOB_AFRH    ( *( ( volatile unsigned long int *)( GPIOB_BAR + 0x24UL ) ) )

#define GPIOC_MODER   ( *( ( volatile unsigned long int *)( GPIOC_BAR + 0x00UL ) ) )
#define GPIOC_OTYPER  ( *( ( volatile unsigned long int *)( GPIOC_BAR + 0x04UL ) ) )
#define GPIOC_OSPEEDR ( *( ( volatile unsigned long int *)( GPIOC_BAR + 0x08UL ) ) )
#define GPIOC_PUPDR   ( *( ( volatile unsigned long int *)( GPIOC_BAR + 0x0CUL ) ) )
#define GPIOC_IDR     ( *( ( volatile unsigned long int *)( GPIOC_BAR + 0x10UL ) ) )
#define GPIOC_ODR     ( *( ( volatile unsigned long int *)( GPIOC_BAR + 0x14UL ) ) )
#define GPIOC_BSRR    ( *( ( volatile unsigned long int *)( GPIOC_BAR + 0x18UL ) ) )
#define GPIOC_LCKR    ( *( ( volatile unsigned long int *)( GPIOC_BAR + 0x1CUL ) ) )
#define GPIOC_AFRL    ( *( ( volatile unsigned long int *)( GPIOC_BAR + 0x20UL ) ) )
#define GPIOC_AFRH    ( *( ( volatile unsigned long int *)( GPIOC_BAR + 0x24UL ) ) )

#define GPIOD_MODER   ( *( ( volatile unsigned long int *)( GPIOD_BAR + 0x00UL ) ) )
#define GPIOD_OTYPER  ( *( ( volatile unsigned long int *)( GPIOD_BAR + 0x04UL ) ) )
#define GPIOD_OSPEEDR ( *( ( volatile unsigned long int *)( GPIOD_BAR + 0x08UL ) ) )
#define GPIOD_PUPDR   ( *( ( volatile unsigned long int *)( GPIOD_BAR + 0x0CUL ) ) )
#define GPIOD_IDR     ( *( ( volatile unsigned long int *)( GPIOD_BAR + 0x10UL ) ) )
#define GPIOD_ODR     ( *( ( volatile unsigned long int *)( GPIOD_BAR + 0x14UL ) ) )
#define GPIOD_BSRR    ( *( ( volatile unsigned long int *)( GPIOD_BAR + 0x18UL ) ) )
#define GPIOD_LCKR    ( *( ( volatile unsigned long int *)( GPIOD_BAR + 0x1CUL ) ) )
#define GPIOD_AFRL    ( *( ( volatile unsigned long int *)( GPIOD_BAR + 0x20UL ) ) )
#define GPIOD_AFRH    ( *( ( volatile unsigned long int *)( GPIOD_BAR + 0x24UL ) ) )

#define GPIOE_MODER   ( *( ( volatile unsigned long int *)( GPIOE_BAR + 0x00UL ) ) )
#define GPIOE_OTYPER  ( *( ( volatile unsigned long int *)( GPIOE_BAR + 0x04UL ) ) )
#define GPIOE_OSPEEDR ( *( ( volatile unsigned long int *)( GPIOE_BAR + 0x08UL ) ) )
#define GPIOE_PUPDR   ( *( ( volatile unsigned long int *)( GPIOE_BAR + 0x0CUL ) ) )
#define GPIOE_IDR     ( *( ( volatile unsigned long int *)( GPIOE_BAR + 0x10UL ) ) )
#define GPIOE_ODR     ( *( ( volatile unsigned long int *)( GPIOE_BAR + 0x14UL ) ) )
#define GPIOE_BSRR    ( *( ( volatile unsigned long int *)( GPIOE_BAR + 0x18UL ) ) )
#define GPIOE_LCKR    ( *( ( volatile unsigned long int *)( GPIOE_BAR + 0x1CUL ) ) )
#define GPIOE_AFRL    ( *( ( volatile unsigned long int *)( GPIOE_BAR + 0x20UL ) ) )
#define GPIOE_AFRH    ( *( ( volatile unsigned long int *)( GPIOE_BAR + 0x24UL ) ) )

#define GPIOH_MODER   ( *( ( volatile unsigned long int *)( GPIOH_BAR + 0x00UL ) ) )
#define GPIOH_OTYPER  ( *( ( volatile unsigned long int *)( GPIOH_BAR + 0x04UL ) ) )
#define GPIOH_OSPEEDR ( *( ( volatile unsigned long int *)( GPIOH_BAR + 0x08UL ) ) )
#define GPIOH_PUPDR   ( *( ( volatile unsigned long int *)( GPIOH_BAR + 0x0CUL ) ) )
#define GPIOH_IDR     ( *( ( volatile unsigned long int *)( GPIOH_BAR + 0x10UL ) ) )
#define GPIOH_ODR     ( *( ( volatile unsigned long int *)( GPIOH_BAR + 0x14UL ) ) )
#define GPIOH_BSRR    ( *( ( volatile unsigned long int *)( GPIOH_BAR + 0x18UL ) ) )
#define GPIOH_LCKR    ( *( ( volatile unsigned long int *)( GPIOH_BAR + 0x1CUL ) ) )
#define GPIOH_AFRL    ( *( ( volatile unsigned long int *)( GPIOH_BAR + 0x20UL ) ) )
#define GPIOH_AFRH    ( *( ( volatile unsigned long int *)( GPIOH_BAR + 0x24UL ) ) )

