matekai/STM32F401RE_prj000/prj/inc/iodefine.h
/* ==========================
 *  RCC SFR definition
========================== */
#define RCC_CR         ( *( ( volatile unsigned long int *)( RCC_BAR + 0x00UL ) ) )
#define RCC_PLLCFGR    ( *( ( volatile unsigned long int *)( RCC_BAR + 0x04UL ) ) )
#define RCC_CFGR       ( *( ( volatile unsigned long int *)( RCC_BAR + 0x08UL ) ) )
#define RCC_CIR        ( *( ( volatile unsigned long int *)( RCC_BAR + 0x0CUL ) ) )
#define RCC_AHB1RSTR   ( *( ( volatile unsigned long int *)( RCC_BAR + 0x10UL ) ) )
#define RCC_AHB2RSTR   ( *( ( volatile unsigned long int *)( RCC_BAR + 0x14UL ) ) )
#define RCC_APB1RSTR   ( *( ( volatile unsigned long int *)( RCC_BAR + 0x20UL ) ) )
#define RCC_APB2RSTR   ( *( ( volatile unsigned long int *)( RCC_BAR + 0x24UL ) ) )
#define RCC_AHB1ENR    ( *( ( volatile unsigned long int *)( RCC_BAR + 0x30UL ) ) )
#define RCC_AHB2ENR    ( *( ( volatile unsigned long int *)( RCC_BAR + 0x34UL ) ) )
#define RCC_APB1ENR    ( *( ( volatile unsigned long int *)( RCC_BAR + 0x40UL ) ) )
#define RCC_APB2ENR    ( *( ( volatile unsigned long int *)( RCC_BAR + 0x44UL ) ) )
#define RCC_AHB1LPENR  ( *( ( volatile unsigned long int *)( RCC_BAR + 0x50UL ) ) )
#define RCC_AHB2LPENR  ( *( ( volatile unsigned long int *)( RCC_BAR + 0x54UL ) ) )
#define RCC_APB1LPENR  ( *( ( volatile unsigned long int *)( RCC_BAR + 0x60UL ) ) )
#define RCC_APB2LPENR  ( *( ( volatile unsigned long int *)( RCC_BAR + 0x64UL ) ) )
#define RCC_BDCR       ( *( ( volatile unsigned long int *)( RCC_BAR + 0x70UL ) ) )
#define RCC_CSR        ( *( ( volatile unsigned long int *)( RCC_BAR + 0x74UL ) ) )
#define RCC_SSCGR      ( *( ( volatile unsigned long int *)( RCC_BAR + 0x80UL ) ) )
#define RCC_PLLI2SCFGR ( *( ( volatile unsigned long int *)( RCC_BAR + 0x84UL ) ) )
#define RCC_DCKCFGR    ( *( ( volatile unsigned long int *)( RCC_BAR + 0x8CUL ) ) )

/* ==========================
 *  USART6 SFR definition
========================== */
#define USART6_SR      ( *( ( volatile unsigned long int *)( USART6_BAR + 0x00UL ) ) )
#define USART6_DR      ( *( ( volatile unsigned long int *)( USART6_BAR + 0x04UL ) ) )
#define USART6_BRR     ( *( ( volatile unsigned long int *)( USART6_BAR + 0x08UL ) ) )
#define USART6_CR1     ( *( ( volatile unsigned long int *)( USART6_BAR + 0x0CUL ) ) )
#define USART6_CR2     ( *( ( volatile unsigned long int *)( USART6_BAR + 0x10UL ) ) )
#define USART6_CR3     ( *( ( volatile unsigned long int *)( USART6_BAR + 0x14UL ) ) )
#define USART6_GTPR    ( *( ( volatile unsigned long int *)( USART6_BAR + 0x18UL ) ) )

/* ==========================
 *  USART2 SFR definition
========================== */
#define USART2_SR      ( *( ( volatile unsigned long int *)( USART2_BAR + 0x00UL ) ) )
#define USART2_DR      ( *( ( volatile unsigned long int *)( USART2_BAR + 0x04UL ) ) )
#define USART2_BRR     ( *( ( volatile unsigned long int *)( USART2_BAR + 0x08UL ) ) )
#define USART2_CR1     ( *( ( volatile unsigned long int *)( USART2_BAR + 0x0CUL ) ) )
#define USART2_CR2     ( *( ( volatile unsigned long int *)( USART2_BAR + 0x10UL ) ) )
#define USART2_CR3     ( *( ( volatile unsigned long int *)( USART2_BAR + 0x14UL ) ) )
#define USART2_GTPR    ( *( ( volatile unsigned long int *)( USART2_BAR + 0x18UL ) ) )

/* ==========================
 *  USART1 SFR definition
========================== */
#define USART1_SR      ( *( ( volatile unsigned long int *)( USART1_BAR + 0x00UL ) ) )
#define USART1_DR      ( *( ( volatile unsigned long int *)( USART1_BAR + 0x04UL ) ) )
#define USART1_BRR     ( *( ( volatile unsigned long int *)( USART1_BAR + 0x08UL ) ) )
#define USART1_CR1     ( *( ( volatile unsigned long int *)( USART1_BAR + 0x0CUL ) ) )
#define USART1_CR2     ( *( ( volatile unsigned long int *)( USART1_BAR + 0x10UL ) ) )
#define USART1_CR3     ( *( ( volatile unsigned long int *)( USART1_BAR + 0x14UL ) ) )
#define USART1_GTPR    ( *( ( volatile unsigned long int *)( USART1_BAR + 0x18UL ) ) )

/* ==========================
 *  TIM2 SFR definition
========================== */
#define TIM2_CR1      ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x00UL ) ) )
#define TIM2_CR2      ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x04UL ) ) )
#define TIM2_SMCR     ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x08UL ) ) )
#define TIM2_DIER     ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x0CUL ) ) )
#define TIM2_SR       ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x10UL ) ) )
#define TIM2_EGR      ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x14UL ) ) )
#define TIM2_CCMR1    ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x18UL ) ) )
#define TIM2_CCMR2    ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x1CUL ) ) )
#define TIM2_CCER     ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x20UL ) ) )
#define TIM2_CNT      ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x24UL ) ) )
#define TIM2_PSC      ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x28UL ) ) )
#define TIM2_ARR      ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x2CUL ) ) )
#define TIM2_CCR1     ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x34UL ) ) )
#define TIM2_CCR2     ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x38UL ) ) )
#define TIM2_CCR3     ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x3CUL ) ) )
#define TIM2_CCR4     ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x40UL ) ) )
#define TIM2_DCR      ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x48UL ) ) )
#define TIM2_DMAR     ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x4CUL ) ) )
#define TIM2_OR       ( *( ( volatile unsigned long int *)( TIM2_BAR + 0x50UL ) ) )

/* ==========================
 *  TIM3 SFR definition
========================== */
#define TIM3_CR1      ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x00UL ) ) )
#define TIM3_CR2      ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x04UL ) ) )
#define TIM3_SMCR     ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x08UL ) ) )
#define TIM3_DIER     ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x0CUL ) ) )
#define TIM3_SR       ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x10UL ) ) )
#define TIM3_EGR      ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x14UL ) ) )
#define TIM3_CCMR1    ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x18UL ) ) )
#define TIM3_CCMR2    ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x1CUL ) ) )
#define TIM3_CCER     ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x20UL ) ) )
#define TIM3_CNT      ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x24UL ) ) )
#define TIM3_PSC      ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x28UL ) ) )
#define TIM3_ARR      ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x2CUL ) ) )
#define TIM3_CCR1     ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x34UL ) ) )
#define TIM3_CCR2     ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x38UL ) ) )
#define TIM3_CCR3     ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x3CUL ) ) )
#define TIM3_CCR4     ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x40UL ) ) )
#define TIM3_DCR      ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x48UL ) ) )
#define TIM3_DMAR     ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x4CUL ) ) )
#define TIM3_OR       ( *( ( volatile unsigned long int *)( TIM3_BAR + 0x50UL ) ) )

