matekai/STM32F401RE_prj000/prj/inc/iodefine.h
/* ==========================
 *  TIM4 SFR definition
========================== */
#define TIM4_CR1      ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x00UL ) ) )
#define TIM4_CR2      ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x04UL ) ) )
#define TIM4_SMCR     ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x08UL ) ) )
#define TIM4_DIER     ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x0CUL ) ) )
#define TIM4_SR       ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x10UL ) ) )
#define TIM4_EGR      ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x14UL ) ) )
#define TIM4_CCMR1    ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x18UL ) ) )
#define TIM4_CCMR2    ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x1CUL ) ) )
#define TIM4_CCER     ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x20UL ) ) )
#define TIM4_CNT      ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x24UL ) ) )
#define TIM4_PSC      ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x28UL ) ) )
#define TIM4_ARR      ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x2CUL ) ) )
#define TIM4_CCR1     ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x34UL ) ) )
#define TIM4_CCR2     ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x38UL ) ) )
#define TIM4_CCR3     ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x3CUL ) ) )
#define TIM4_CCR4     ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x40UL ) ) )
#define TIM4_DCR      ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x48UL ) ) )
#define TIM4_DMAR     ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x4CUL ) ) )
#define TIM4_OR       ( *( ( volatile unsigned long int *)( TIM4_BAR + 0x50UL ) ) )

/* ==========================
 *  TIM5 SFR definition
========================== */
#define TIM5_CR1      ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x00UL ) ) )
#define TIM5_CR2      ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x04UL ) ) )
#define TIM5_SMCR     ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x08UL ) ) )
#define TIM5_DIER     ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x0CUL ) ) )
#define TIM5_SR       ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x10UL ) ) )
#define TIM5_EGR      ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x14UL ) ) )
#define TIM5_CCMR1    ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x18UL ) ) )
#define TIM5_CCMR2    ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x1CUL ) ) )
#define TIM5_CCER     ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x20UL ) ) )
#define TIM5_CNT      ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x24UL ) ) )
#define TIM5_PSC      ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x28UL ) ) )
#define TIM5_ARR      ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x2CUL ) ) )
#define TIM5_CCR1     ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x34UL ) ) )
#define TIM5_CCR2     ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x38UL ) ) )
#define TIM5_CCR3     ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x3CUL ) ) )
#define TIM5_CCR4     ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x40UL ) ) )
#define TIM5_DCR      ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x48UL ) ) )
#define TIM5_DMAR     ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x4CUL ) ) )
#define TIM5_OR       ( *( ( volatile unsigned long int *)( TIM5_BAR + 0x50UL ) ) )

/* ==========================
 *  NVIC SFR definition
========================== */
#define NVIC_ISER0    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x100UL ) ) )
#define NVIC_ISER1    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x104UL ) ) )
#define NVIC_ISER2    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x108UL ) ) )
#define NVIC_ISER3    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x10CUL ) ) )
#define NVIC_ISER4    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x110UL ) ) )
#define NVIC_ISER5    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x114UL ) ) )
#define NVIC_ISER6    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x118UL ) ) )
#define NVIC_ISER7    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x11CUL ) ) )

#define NVIC_ICER0    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x180UL ) ) )
#define NVIC_ICER1    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x184UL ) ) )
#define NVIC_ICER2    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x188UL ) ) )
#define NVIC_ICER3    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x18CUL ) ) )
#define NVIC_ICER4    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x190UL ) ) )
#define NVIC_ICER5    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x194UL ) ) )
#define NVIC_ICER6    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x198UL ) ) )
#define NVIC_ICER7    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x19CUL ) ) )

#define NVIC_ISPR0    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x200UL ) ) )
#define NVIC_ISPR1    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x204UL ) ) )
#define NVIC_ISPR2    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x208UL ) ) )
#define NVIC_ISPR3    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x20CUL ) ) )
#define NVIC_ISPR4    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x210UL ) ) )
#define NVIC_ISPR5    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x214UL ) ) )
#define NVIC_ISPR6    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x218UL ) ) )
#define NVIC_ISPR7    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x21CUL ) ) )

#define NVIC_ICPR0    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x280UL ) ) )
#define NVIC_ICPR1    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x284UL ) ) )
#define NVIC_ICPR2    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x288UL ) ) )
#define NVIC_ICPR3    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x28CUL ) ) )
#define NVIC_ICPR4    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x290UL ) ) )
#define NVIC_ICPR5    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x294UL ) ) )
#define NVIC_ICPR6    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x298UL ) ) )
#define NVIC_ICPR7    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x29CUL ) ) )

#define NVIC_IABR0    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x300UL ) ) )
#define NVIC_IABR1    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x304UL ) ) )
#define NVIC_IABR2    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x308UL ) ) )
#define NVIC_IABR3    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x30CUL ) ) )
#define NVIC_IABR4    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x310UL ) ) )
#define NVIC_IABR5    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x314UL ) ) )
#define NVIC_IABR6    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x318UL ) ) )
#define NVIC_IABR7    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x31CUL ) ) )

#define NVIC_IPR0     ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x400UL ) ) )
#define NVIC_IPR1     ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x404UL ) ) )
#define NVIC_IPR2     ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x408UL ) ) )
#define NVIC_IPR3     ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x40CUL ) ) )
#define NVIC_IPR4     ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x410UL ) ) )
#define NVIC_IPR5     ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x414UL ) ) )
#define NVIC_IPR6     ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x418UL ) ) )
#define NVIC_IPR7     ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x41CUL ) ) )
#define NVIC_IPR8     ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x420UL ) ) )
#define NVIC_IPR9     ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x424UL ) ) )
#define NVIC_IPR10    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x428UL ) ) )
#define NVIC_IPR11    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x42CUL ) ) )
#define NVIC_IPR12    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x430UL ) ) )
#define NVIC_IPR13    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x434UL ) ) )
#define NVIC_IPR14    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x438UL ) ) )
#define NVIC_IPR15    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x43CUL ) ) )
#define NVIC_IPR16    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x440UL ) ) )
#define NVIC_IPR17    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x444UL ) ) )
#define NVIC_IPR18    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x448UL ) ) )
#define NVIC_IPR19    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x44CUL ) ) )
#define NVIC_IPR20    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x450UL ) ) )
#define NVIC_IPR21    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x454UL ) ) )
#define NVIC_IPR22    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x458UL ) ) )
#define NVIC_IPR23    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x45CUL ) ) )
#define NVIC_IPR24    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x460UL ) ) )
#define NVIC_IPR25    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x464UL ) ) )
#define NVIC_IPR26    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x468UL ) ) )
#define NVIC_IPR27    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x46CUL ) ) )
#define NVIC_IPR28    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x470UL ) ) )
#define NVIC_IPR29    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x474UL ) ) )
#define NVIC_IPR30    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x478UL ) ) )
#define NVIC_IPR31    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x47CUL ) ) )
#define NVIC_IPR32    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x480UL ) ) )
#define NVIC_IPR33    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x484UL ) ) )
#define NVIC_IPR34    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x488UL ) ) )
#define NVIC_IPR35    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x48CUL ) ) )
#define NVIC_IPR36    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x490UL ) ) )
#define NVIC_IPR37    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x494UL ) ) )
#define NVIC_IPR38    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x498UL ) ) )
#define NVIC_IPR39    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x49CUL ) ) )
#define NVIC_IPR40    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4A0UL ) ) )
#define NVIC_IPR41    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4A4UL ) ) )
#define NVIC_IPR42    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4A8UL ) ) )
#define NVIC_IPR43    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4ACUL ) ) )
#define NVIC_IPR44    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4B0UL ) ) )
#define NVIC_IPR45    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4B4UL ) ) )
#define NVIC_IPR46    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4B8UL ) ) )
#define NVIC_IPR47    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4BCUL ) ) )
#define NVIC_IPR48    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4C0UL ) ) )
#define NVIC_IPR49    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4C4UL ) ) )
#define NVIC_IPR50    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4C8UL ) ) )
#define NVIC_IPR51    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4CCUL ) ) )
#define NVIC_IPR52    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4D0UL ) ) )
#define NVIC_IPR53    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4D4UL ) ) )
#define NVIC_IPR54    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4D8UL ) ) )
#define NVIC_IPR55    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4DCUL ) ) )
#define NVIC_IPR56    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4E0UL ) ) )
#define NVIC_IPR57    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4E4UL ) ) )
#define NVIC_IPR58    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4E8UL ) ) )
#define NVIC_IPR59    ( *( ( volatile unsigned long int *)( NVIC_BAR + 0x4ECUL ) ) )

#define NVIC_STIR     ( *( ( volatile unsigned long int *)( NVIC_BAR + 0xF00UL ) ) )

#endif /* ifndef hoge_H */
